smLab_test/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

smLab_test/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.ЗначениеКоличества</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

smLab_test/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.ЗначениеКоличества</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

smLab_test/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

smLab_test/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "";
	
	ПараметрыЗапроса = Новый Структура();
	
	СформироватьТекстЗапросаТовары(Запрос.Текст, ПараметрыЗапроса);
	
	//Контроль заполненности "Товары.Склад"
	СформироватьТекстЗапросаКонтрольПоляСклад(Запрос.Текст, ПараметрыЗапроса);
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл	
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;	
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	//Контроль заполненности "Товары.Склад"
	РезультатЗапросаКонтрольПоляСклад = ПакетРезультатов[1];
	ВыборкаКонтрольПоляСклад = РезультатЗапросаКонтрольПоляСклад.Выбрать();
	
	Пока ВыборкаКонтрольПоляСклад.Следующий() Цикл
		СообщитьОбОшибкеКонтрольПоляСклад(ВыборкаКонтрольПоляСклад, Отказ);
	КонецЦикла;	 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПолучитьПоляПрограммнойПроверкиЗаполнения());
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	
	СтруктураТаблицПроведения = РаботаСДокументами.ПолучитьСтруктуруТаблицПроведения(ЭтотОбъект);	
	РаботаСДокументами.ДобавитьСтандартныеДвижения(ЭтотОбъект, СтруктураТаблицПроведения);

	Движения.Записать();
	
	РезультатПроверки = РаботаСДокументами.ВыполнитьСтандартныйКонтроль(СтруктураТаблицПроведения, ЭтотОбъект);
	
	Если РезультатПроверки.Ошибка Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатПроверки.ТекстОшибки, , , ,Отказ);
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
			
	Движения.ОстаткиТоваров.Записывать = Истина;	
	Движения.Продажи.Записывать = Истина;
	
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	
	СтруктураТаблицПроведения = РаботаСДокументами.ПолучитьСтруктуруТаблицПроведения(ЭтотОбъект);	
	РаботаСДокументами.ДобавитьСтандартныеДвижения(ЭтотОбъект, СтруктураТаблицПроведения, Истина);

	Движения.Записать();
	
	РезультатПроверки = РаботаСДокументами.ВыполнитьСтандартныйКонтроль(СтруктураТаблицПроведения, ЭтотОбъект);
	
	Если РезультатПроверки.Ошибка Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатПроверки.ТекстОшибки, , , ,Отказ);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		 Если ДанныеЗаполнения.Свойство("Товары") И
			 ЗначениеЗаполнено(ДанныеЗаполнения.Товары) И 
			 ТипЗнч(ДанныеЗаполнения.Товары) = Тип("ТаблицаЗначений") Тогда
		 	
		 	Товары.Загрузить(ДанныеЗаполнения.Товары);
		 	
		 КонецЕсли;	 
		  	 	
		 Если ДанныеЗаполнения.Свойство("Номенклатура") И
		 	ЗначениеЗаполнено(ДанныеЗаполнения.Номенклатура) И
		 	ТипЗнч(ДанныеЗаполнения.Номенклатура) = Тип("Массив") И
		 	Не Товары.Количество() Тогда
		 		
		 	  ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДанныеЗаполнения.Номенклатура);		 	  
		 	  ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Товары, ДанныеЗаполнения.Номенклатура, "Номенклатура");	 
		 	  
		 КонецЕсли;		 
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПоляПрограммнойПроверкиЗаполнения() 
	
	СписокПолей = Новый Массив;
	СписокПолей.Добавить("Товары.Склад");
	
	Возврат СписокПолей;
	
КонецФункции

Процедура СформироватьТекстЗапросаТовары(ТекстЗапроса, ПараметрыЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|	Товары.Склад,
	|	Товары.Подразделение,
	|	Товары.Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары";
	
	ПараметрыЗапроса.Вставить("Товары", Товары.Выгрузить(,"НомерСтроки, Номенклатура, Склад, Подразделение, Количество"));
	
КонецПроцедуры

Процедура СформироватьТекстЗапросаКонтрольПоляСклад(ТекстЗапроса, ПараметрыЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительЗапросовВПакете() +
	"ВЫБРАТЬ
	|	ВТ_Товары.НомерСтроки
	|ИЗ ВТ_Товары КАК ВТ_Товары
	|
	|ГДЕ ВТ_Товары.Номенклатура.Тип = Значение(Перечисление.ТипыНоменклатуры.Товар)
	|И ВТ_Товары.Склад = Значение(Справочник.Склады.ПустаяСсылка)";
	
КонецПроцедуры

Процедура СообщитьОбОшибкеКонтрольПоляСклад(ВыборкаКонтрольПоляСклад, Отказ)
	
	ТекстОшибки = СтрШаблон(Нстр("ru = 'Не заполнено поле ''%1'' в строке №%2'"), "Склад", ВыборкаКонтрольПоляСклад.НомерСтроки);
	ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", ВыборкаКонтрольПоляСклад.НомерСтроки, "Склад");
	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , ПутьКДанным, Отказ);
	
КонецПроцедуры
	
#КонецОбласти	

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
